app/Controllers/Analisis.php

    public function index(): string
    {
        $yearModel = new YearModel();


        $years = $yearModel->orderBy('year','DESC')->findAll();
---
SELECT *
FROM `years`
ORDER BY `year` DESC