app/Controllers/Home.php

    public function index(): string
    {
        $subDistrictModel = new SubDistrictModel();
        $data['sub_districts'] = $subDistrictModel->findAll();
---
SELECT *
FROM `sub_districts`

    public function detail($subDistrictId)
    {
        $subDistrictModel = new SubDistrictModel();
        $landAreaModel = new LandAreaModel();
        $productionModel = new ProductionModel();
        $productivityModel = new ProductivityModel();
        $yearModel = new YearModel();

        $subDistrictNames = $subDistrictModel
        ->where('sub_district_id', $subDistrictId)
        ->first()['sub_district_name'];

        $landAreaTotals = $landAreaModel->getLandAreasBySubdistrict($subDistrictId);
        $productionTotals = $productionModel->getProductionsBySubdistrict($subDistrictId);
        $productivityTotals = $productivityModel->getProductivitiesBySubdistrict($subDistrictId);
        $years = $yearModel->findAll();
---
SELECT *
FROM `sub_districts`
WHERE `sub_district_id` = '1'
 LIMIT 1
SELECT *
FROM `years`