app/Models/LandAreaModel.php

    public function getLandAreasBySubdistrict($subDistrictId)
    {
        $data = $this->select('*')
            ->join('years', 'land_area_total.year_id = years.year_id', 'inner')
            ->join('land_area_details', 'land_area_total.land_area_id = land_area_details.land_area_id', 'inner')
            ->join('sub_districts', 'land_area_details.sub_district_id = sub_districts.sub_district_id', 'inner')
            ->where('sub_districts.sub_district_id', $subDistrictId);

        return $data->get()->getResultArray();
---
SELECT *
FROM `land_area_total`
INNER JOIN `years` ON `land_area_total`.`year_id` = `years`.`year_id`
INNER JOIN `land_area_details` ON `land_area_total`.`land_area_id` = `land_area_details`.`land_area_id`
INNER JOIN `sub_districts` ON `land_area_details`.`sub_district_id` = `sub_districts`.`sub_district_id`
WHERE `sub_districts`.`sub_district_id` = '1'

    public function getLandAreaTotalByYear($year)
    {
        $data = $this->select('*')
            ->join('years', 'land_area_total.year_id = years.year_id', 'inner')
            ->where('years.year', $year);

            return $data->get()->getFirstRow();
---
SELECT *
FROM `land_area_total`
INNER JOIN `years` ON `land_area_total`.`year_id` = `years`.`year_id`
WHERE `years`.`year` = '2015'