app/Models/ProductivityModel.php

    public function getProductivitiesBySubdistrict($subDistrictId)
    {
        $data = $this->select('*')
            ->join('years', 'productivity_total.year_id = years.year_id', 'inner')
            ->join('productivity_details', 'productivity_total.productivity_id = productivity_details.productivity_id', 'inner')
            ->join('sub_districts', 'productivity_details.sub_district_id = sub_districts.sub_district_id', 'inner')
            ->where('sub_districts.sub_district_id', $subDistrictId);

        return $data->get()->getResultArray();
---
SELECT *
FROM `productivity_total`
INNER JOIN `years` ON `productivity_total`.`year_id` = `years`.`year_id`
INNER JOIN `productivity_details` ON `productivity_total`.`productivity_id` = `productivity_details`.`productivity_id`
INNER JOIN `sub_districts` ON `productivity_details`.`sub_district_id` = `sub_districts`.`sub_district_id`
WHERE `sub_districts`.`sub_district_id` = '1'