app/Models/ProductionModel.php

SELECT *
FROM `production_total`
INNER JOIN `years` ON `production_total`.`year_id` = `years`.`year_id`
INNER JOIN `production_details` ON `production_total`.`production_id` = `production_details`.`production_id`
INNER JOIN `sub_districts` ON `production_details`.`sub_district_id` = `sub_districts`.`sub_district_id`
WHERE `sub_districts`.`sub_district_id` = '1'
---
    public function getProductionsBySubdistrict($subDistrictId)
    {
        $data = $this->select('*')
            ->join('years', 'production_total.year_id = years.year_id', 'inner')
            ->join('production_details', 'production_total.production_id = production_details.production_id', 'inner')
            ->join('sub_districts', 'production_details.sub_district_id = sub_districts.sub_district_id', 'inner')
            ->where('sub_districts.sub_district_id', $subDistrictId);

        return $data->get()->getResultArray();

SELECT *
FROM `production_total`
INNER JOIN `years` ON `production_total`.`year_id` = `years`.`year_id`
WHERE `years`.`year` = '2015'
---
    public function getProductionTotalByYear($year)
    {
        $data = $this->select('*')
            ->join('years', 'production_total.year_id = years.year_id', 'inner')
            ->where('years.year', $year);

        return $data->get()->getFirstRow();