app/Models/YearModel.php

SELECT *
FROM `years`
---
    public function getYears()
    {
        $data = $this->select('*');

        return $data->get()->getResultObject();